app/controllers/microposts_controller.rb

  def create
  respond_to do |format|
	@users = User.paginate(page: params[:page])
      format.html {@microposts}
      format.json { render json: @microposts }
	   @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "salut\r\n"], ["user_id", 10], ["created_at", "2015-01-03 19:08:49.006274"], ["updated_at", "2015-01-03 19:08:49.006274"]]